@echo off
setlocal
cd %~dp0

set CURDIR=%~dp0

echo.
echo ■======================================================■
echo ■  Zipファイルの解凍を開始します！
echo ■======================================================■

echo.
echo #-------------------------------------------------------#
set /p ZIPRES=解凍します。よろしいですか？...  Y/N?
echo #-------------------------------------------------------#

if /i {"%ZIPRES%"}=={"N"} (
   rem 解凍処理をスキップする
   goto SKIP
   
   ) else (
   echo カレントディレクトリの「*.zip」ファイルを全部解凍します。
   for %%i in (*.zip) do (
      echo 対象ファイル：　「%%i」
      call :SUB %%i
      )
   )
   
   
goto END

:SUB
echo 解凍中...
set INPUT_FILE=%1

lhaplus /o:"%CURDIR%" %INPUT_FILE%
exit /b

:END
echo.
echo *-------------------------------------------------------*
echo *  zipファイルの解凍が完了しました！
echo *-------------------------------------------------------*
goto FIN

:SKIP
echo.
echo *-------------------------------------------------------*
echo *  zipファイルの解凍が完了しました！
echo *-------------------------------------------------------*
goto FIN

:FIN
rem 終了処理
exit
